projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/УстановкаЦенКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>УстановкаЦенКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаДату</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокКонтрагентов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьКлиентаПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУслугОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяУслугаОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДополнительныхУслугОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСтранНачалаТранзита</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСтран</v8:Type>
						<v8:Type>cfg:CatalogRef.СтранаОформления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКодовУКТЗЕД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыКодовУКТЗЕД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпецСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СеткиСпецЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСпецЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСпецЦены2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоСпецЦены3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенообразованиеУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаУслугиТекущая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаПервуюCMRТекущая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаДополнительнуюCMRТекущая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаДополнительныйКодТекущая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаЦеныТекущая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБесплатныхКодовТекущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаУслугиНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаПервуюCMRНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаДополнительнуюCMRНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗаДополнительныйКодНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаЦеныНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоБесплатныхКодовНовое</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/InformationRegisters/ТарифныеСеткиОбеспечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТарифныеСеткиОбеспечения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасчетаЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндивидуальныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитикаСумм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АналитикиСуммЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительнаяАналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеАналитикиЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпецЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубконтоСпецЦены3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>cfg:CatalogRef.Паромы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТаможенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

projects/russian-transit/src/cfe/Русский_Транзит/DataProcessors/УстановкаЦенКонтрагентов/Forms/ИсторияЦенКонтрагента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент"				, Контрагент);
	Параметры.Свойство("Принципал"				, Принципал);
	Параметры.Свойство("УслугаОрганизации"		, УслугаОрганизации);
	Параметры.Свойство("СтранаНачалаТранзита"	, ГруппаСтранНачалаТранзита);
	Параметры.Свойство("ГруппаКодовУКТЗЕД"		, ГруппаКодовУКТЗЕД);
	Параметры.Свойство("СпецЦены"				, СпецЦены);
	Параметры.Свойство("СубконтоСпецЦены"		, Объект.СубконтоСпецЦены);
	
	ЗаполнитьТабличныйДокументНаСервере();
	
	ЭтаФорма.Заголовок = "История цен " + СокрЛП(Контрагент) 
							+ " по услуге " + СокрЛП(УслугаОрганизации) + " (" + СокрЛП(Принципал) + ")";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	                    
	ЗаполнитьТабличныйДокументНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументНаСервере()

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Контрагент"			, Контрагент);
	СтруктураПараметров.Вставить("Принципал"			, Принципал);
	СтруктураПараметров.Вставить("УслугаОрганизации"	, УслугаОрганизации);
	СтруктураПараметров.Вставить("СтранаНачалаТранзита"	, ГруппаСтранНачалаТранзита);
	СтруктураПараметров.Вставить("ГруппаКодовУКТЗЕД"	, ГруппаКодовУКТЗЕД);
	СтруктураПараметров.Вставить("СпецЦены"				, СпецЦены);
	СтруктураПараметров.Вставить("ТипУслуги"			, ТипУслуги);
	СтруктураПараметров.Вставить("СубконтоСпецЦены"		, Объект.СубконтоСпецЦены);

	ПолучитьТабличныйДокументИсторииЦен(СтруктураПараметров);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТабличныйДокументИсторииЦен(СтруктураПараметров)
	
	ТабличныйДокументИсторииЦен.Очистить();
	
	СписокАктуальныхПериодов = ПолучитьСписокПериодов();

	Если СписокПериодов.Количество() = 0 Тогда
		СписокПериодов = СписокАктуальныхПериодов;
		Инд = 1;
		Для каждого ЭлСп Из СписокПериодов Цикл
			Если Инд > 3 Тогда
				Прервать;
			КонецЕсли;
			ЭлСп.Пометка = Истина;
			Инд = Инд + 1;
		КонецЦикла;
	Иначе
		пСписокП = СписокПериодов.Скопировать();
		СписокПериодов.Очистить();
		Для каждого ЭлСп Из СписокАктуальныхПериодов Цикл
			НовЭл = СписокПериодов.Добавить(ЭлСп.Значение, ЭлСп.Представление);
			СтЭл = пСписокП.НайтиПоЗначению(НовЭл.Значение);
			Если СтЭл <> Неопределено Тогда
				НовЭл.Пометка = СтЭл.Пометка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Макет 			= РегистрыСведений.ТарифныеСеткиОбеспечения.ПолучитьМакет("МакетСеткиЦен");
	ОблПустаяСтрока = Макет.ПолучитьОбласть("ОбластьПустаяСтрока");
	КодЯзыка 		= "ru";
	
	Для каждого Эл Из СписокПериодов Цикл
		Если НЕ Эл.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстЗаголовка = НСтр("ru='Дата цен: '", КодЯзыка) + Формат(Эл.Значение, "ДФ=dd.MM.yyyy") + НСтр("ru=' г.'", КодЯзыка);
		
		ТабличныйДокументИсторииЦен.Вывести(РегистрыСведений.ТарифныеСеткиОбеспечения.ТабличныйДокументЦенВывод(СтруктураПараметров,, КодЯзыка, ТекстЗаголовка, Эл.Значение));
		ТабличныйДокументИсторииЦен.Вывести(ОблПустаяСтрока);
	КонецЦикла;
	
КонецПроцедуры                      
	
&НаСервере
Функция ПолучитьСписокПериодов()
	
	СписокАктуальныхПериодов = Новый СписокЗначений;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЦенообразованиеСетка.Период КАК Период
			|ИЗ
			|	РегистрСведений.ТарифныеСеткиОбеспечения КАК ЦенообразованиеСетка
			|ГДЕ
			|	ЦенообразованиеСетка.Контрагент = &Контрагент
			|	И ЦенообразованиеСетка.СпецЦены = &СпецЦены
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("Контрагент"					, Контрагент);
		Запрос.УстановитьПараметр("СпецЦены"					, СпецЦены);
		
	
	СписокАктуальныхПериодов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Период"));
	
	Возврат СписокАктуальныхПериодов;

КонецФункции
